package kr.co.study.homework;

public class Homework_20180402 {

	// -----------------------센세 코맨트-----------------------
	/**
	 * 다음과같이 작성해주세요
	 * 1. 반복문은 한번만 사용합니다.
	 * 2. 반복문 안에 반복문은 허용합니다.
	 * 3. 결과값은 다음과같이 나오도록 해주세요(\t 탭문자)
	 *    2*1 = 2 \t 3*1 = 3  \t 4*1 = 4  \t 5*1 = 5
	 *    2*2 = 4 \t 3*2 = 6  \t 4*2 = 8  \t 5*2 = 10
	 *    ......
	 *    .......
	 *    ---------------------------------------
	 *    6*1 = 6 \t 7*1 = 7  \t 8*1 = 8  \t 9*1 = 9
	 *    ....
	 */



	public static void main(String[] args) {

		for (int i = 2; i < 3; i++) {
			for (int j = 1; j < 10; j++) {

				System.out.println(
						i + "*" + j + "=" + i * j + "     " + i + "*" + j + "=" + i * j + "      " + i + "*"
								+ j + "=" + i * j + "     " + i + "*" + j + "=" + i * j);
				if (i != 6) {

				}
			}
		}

		System.out.println("========================================================");

		for (int i = 6; i < 7; i++) {
			for (int j = 1; j < 10; j++) {

				System.out.println(i + "*" + j + "=" + i * j + "     " + i + "*" + j + "=" + i * j + "      " + i + "*"
						+ j + "=" + i * j + "     " + i + "*" + j + "=" + i * j);

			}
		}

	}

}
